## Напишите программу, которая определяет, являются ли три заданных числа (в указанном порядке) последовательными членами арифм.прогресии
num1 = int(input())
num2 = int(input())
if num1<num2:
    print(num1)
else:
    print(num2)      
